test/fixtures/files/stripe-webhook-examples/charge.succeeded.json

{
  "id": "evt_1Ht7PBHKsh0CJgGEEevnesFz",
  "object": "event",
  "api_version": "2020-08-27",
  "created": 1606723600,
  "data": {
    "object": {
      "id": "ch_1Ht7PAHKsh0CJgGEM4n2RAf2",
      "object": "charge",
      "amount": 100,
      "amount_captured": 100,
      "amount_refunded": 0,
      "application": null,
      "application_fee": null,
      "application_fee_amount": null,
      "balance_transaction": "txn_1Ht7PAHKsh0CJgGEgmLUQzAB",
      "billing_details": {
        "address": {
          "city": null,
          "country": null,
          "line1": null,
          "line2": null,
          "postal_code": null,
          "state": null
        },
        "email": null,
        "name": null,
        "phone": null
      },
      "calculated_statement_descriptor": "Stripe",
      "captured": true,
      "created": 1606723600,
      "currency": "usd",
      "customer": "cus_ITuIPfjmJZ1liz",
      "description": null,
      "destination": null,
      "dispute": null,
      "disputed": false,
      "failure_code": null,
      "failure_message": null,
      "fraud_details": {},
      "invoice": null,
      "livemode": false,
      "metadata": {},
      "on_behalf_of": null,
      "order": null,
      "outcome": {
        "network_status": "approved_by_network",
        "reason": null,
        "risk_level": "normal",
        "risk_score": 50,
        "seller_message": "Payment complete.",
        "type": "authorized"
      },
      "paid": true,
      "payment_intent": "pi_1Ht7PAHKsh0CJgGEUWI4oXpe",
      "payment_method": "card_1Hszo6HKsh0CJgGE27wIMNUH",
      "payment_method_details": {
        "card": {
          "brand": "visa",
          "checks": {
            "address_line1_check": null,
            "address_postal_code_check": null,
            "cvc_check": null
          },
          "country": "US",
          "exp_month": 11,
          "exp_year": 2021,
          "fingerprint": "mZtwzQQk8UV8FcSM",
          "funding": "credit",
          "installments": null,
          "last4": "4242",
          "network": "visa",
          "three_d_secure": null,
          "wallet": null
        },
        "type": "card"
      },
      "receipt_email": null,
      "receipt_number": null,
      "receipt_url": "https://pay.stripe.com/receipts/acct_1HpJ5iHKsh0CJgGE/ch_1Ht7PAHKsh0CJgGEM4n2RAf2/rcpt_IU5a5uV01O9bYzcp7lDuKqU3X4ZzqKr",
      "refunded": false,
      "refunds": {
        "object": "list",
        "data": [],
        "has_more": false,
        "total_count": 0,
        "url": "/v1/charges/ch_1Ht7PAHKsh0CJgGEM4n2RAf2/refunds"
      },
      "review": null,
      "shipping": null,
      "source": null,
      "source_transfer": null,
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": "req_pJg2vdH1Hk2Dmy",
    "idempotency_key": null
  },
  "type": "charge.succeeded",
  "webhook": {
    "id": "evt_1Ht7PBHKsh0CJgGEEevnesFz",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1606723600,
    "data": {
      "object": {
        "id": "ch_1Ht7PAHKsh0CJgGEM4n2RAf2",
        "object": "charge",
        "amount": 100,
        "amount_captured": 100,
        "amount_refunded": 0,
        "application": null,
        "application_fee": null,
        "application_fee_amount": null,
        "balance_transaction": "txn_1Ht7PAHKsh0CJgGEgmLUQzAB",
        "billing_details": {
          "address": {
            "city": null,
            "country": null,
            "line1": null,
            "line2": null,
            "postal_code": null,
            "state": null
          },
          "email": null,
          "name": null,
          "phone": null
        },
        "calculated_statement_descriptor": "Stripe",
        "captured": true,
        "created": 1606723600,
        "currency": "usd",
        "customer": "cus_ITuIPfjmJZ1liz",
        "description": null,
        "destination": null,
        "dispute": null,
        "disputed": false,
        "failure_code": null,
        "failure_message": null,
        "fraud_details": {},
        "invoice": null,
        "livemode": false,
        "metadata": {},
        "on_behalf_of": null,
        "order": null,
        "outcome": {
          "network_status": "approved_by_network",
          "reason": null,
          "risk_level": "normal",
          "risk_score": 50,
          "seller_message": "Payment complete.",
          "type": "authorized"
        },
        "paid": true,
        "payment_intent": "pi_1Ht7PAHKsh0CJgGEUWI4oXpe",
        "payment_method": "card_1Hszo6HKsh0CJgGE27wIMNUH",
        "payment_method_details": {
          "card": {
            "brand": "visa",
            "checks": {
              "address_line1_check": null,
              "address_postal_code_check": null,
              "cvc_check": null
            },
            "country": "US",
            "exp_month": 11,
            "exp_year": 2021,
            "fingerprint": "mZtwzQQk8UV8FcSM",
            "funding": "credit",
            "installments": null,
            "last4": "4242",
            "network": "visa",
            "three_d_secure": null,
            "wallet": null
          },
          "type": "card"
        },
        "receipt_email": null,
        "receipt_number": null,
        "receipt_url": "https://pay.stripe.com/receipts/acct_1HpJ5iHKsh0CJgGE/ch_1Ht7PAHKsh0CJgGEM4n2RAf2/rcpt_IU5a5uV01O9bYzcp7lDuKqU3X4ZzqKr",
        "refunded": false,
        "refunds": {
          "object": "list",
          "data": [],
          "has_more": false,
          "total_count": 0,
          "url": "/v1/charges/ch_1Ht7PAHKsh0CJgGEM4n2RAf2/refunds"
        },
        "review": null,
        "shipping": null,
        "source": null,
        "source_transfer": null,
        "statement_descriptor": null,
        "statement_descriptor_suffix": null,
        "status": "succeeded",
        "transfer_data": null,
        "transfer_group": null
      }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
      "id": "req_pJg2vdH1Hk2Dmy",
      "idempotency_key": null
    },
    "type": "charge.succeeded"
  }
}
